<template>
  <div id="summary-04-wrapper">
    <img
      :src="require(`assets/images/summary_04.png`)"
      class="mx-auto mt-6 md:mt-16 mb-7 w-[175px] md:w-[292px]"
    />
    <div id="content" class="w-10/12 mx-auto lg:max-w-[648px] B_04">
      <div class="font-bold">
        4. การทำรัฐประหารของคณะรักษาความสงบแห่งชาติ (คสช.)
      </div>
      <div class="mt-[10px]">
        ด้วยการต่ออายุตุลาการรัฐธรรมนูญบางส่วน
        และการคัดเลือกตุลาการรัฐธรรมนูญหน้าใหม่ โดยอาศัยประกาศและคำสั่งของ คสช.
        รวมถึงรัฐธรรมนูญแห่งราชอาณาจักรไทย พุทธศักราช 2560
        ส่งผลให้แนวโน้มการวินิจฉัยของศาลรัฐธรรมนูญยังคงเดิม
        ซึ่งสร้างผลบวกกับฝั่งการเมืองสายอำนาจเก่า และทหาร ที่มีอำนาจในเวลานั้น
        เช่น
      </div>
      <div class="mt-7">
        <div id="list-dot" />
        วินิจฉัยยุบพรรคไทยรักษาชาติ และอนาคตใหม่
      </div>
      <div>
        <div id="list-dot" />
        วินิจฉัยให้ประยุทธ์ จันทร์โอชา รอดจากการหลุดตำแหน่ง 2 ครั้ง
      </div>
      <div>
        <div id="list-dot" />
        วินิจฉัยให้ธรรมนัส พรหมเผ่า รอดจากการหลุดตำแหน่ง
      </div>
      <div>
        <div id="list-dot" />
        วินิจฉัยให้กฎหมายที่ออกในสมัยรัฐบาลประยุทธ์ จันทร์โอชา ไม่ถูกขัดขวาง
      </div>
    </div>
  </div>
</template>
