<template>
  <div id="summary-01-wrapper">
    <img
      :src="require(`assets/images/summary_01.png`)"
      class="mx-auto mt-6 md:mt-16 mb-7 w-[175px] md:w-[292px]"
    />
    <div id="content" class="w-10/12 mx-auto lg:max-w-[648px] B_04">
      <div class="font-bold">
        1. ศาลรัฐธรรมนูญถูกจัดตั้งขึ้นครั้งแรกตามรัฐธรรมนูญ<br />แห่งราชอาณาจักรไทย
        พุทธศักราช 2540
      </div>
      <div class="mt-[10px]">
        ศาลรัฐธรรมนูญชุดนี้ถูกมองว่าโอนอ่อนให้กับฝ่ายการเมืองที่มีอำนาจในเวลานั้นมากเกินไป
        ซึ่งจะเห็นได้จากผลการวินิจฉัยที่ออกมาเป็นผลบวกกับฝั่งการเมืองสายทักษิณ
        ชินวัตร อย่างเช่น
      </div>
      <div class="mt-7">
        <div id="list-dot" />
        วินิจฉัยให้ทักษิณ ชินวัตร รอดจากการหลุดตำแหน่ง 2 ครั้ง
      </div>
      <div>
        <div id="list-dot" />
        วินิจฉัยให้กฎหมายที่ออกในสมัยรัฐบาลทักษิณ ชินวัตร ไม่ถูกขัดขวาง
      </div>
    </div>
  </div>
</template>
