<template>
  <div id="summary-02-wrapper">
    <img
      :src="require(`assets/images/summary_02.png`)"
      class="mx-auto mt-6 md:mt-16 mb-7 w-[175px] md:w-[292px]"
    />
    <div id="content" class="w-10/12 mx-auto lg:max-w-[648px] B_04">
      <div class="font-bold">
        2. ในหลวงรัชกาลที่ 9 มีพระราชดำรัสเกี่ยวกับหน้าที่ของศาล<br />
        เมื่อวันที่ 25 เมษายน พ.ศ. 2549
      </div>
      <div class="mt-[10px]">
        หลังจากนั้น
        ท่าทีของศาลรัฐธรรมนูญเริ่มเปลี่ยนแปลงท่าทีต่อฝั่งการเมืองสายทักษิณ
        ชินวัตร
        เริ่มตั้งแต่การวินิจฉัยให้การเลือกตั้งที่พรรคไทยรักไทยกำลังได้เปรียบ
        กลายเป็นโมฆะ
        รวมไปถึงการทำงานคณะกรรมการตุลาการรัฐธรรมนูญที่มาจากการแต่งตั้งตามรัฐธรรมนูญแห่งราชอาณาจักรไทย
        (ฉบับชั่วคราว) พุทธศักราช 2549 ที่
      </div>
      <div class="mt-7">
        <div id="list-dot" />
        วินิจฉัยให้ยุบพรรคไทยรักไทย แต่วินิจฉัยไม่ยุบพรรคประชาธิปัตย์
      </div>
    </div>
  </div>
</template>
