<template>
  <div id="summary-03-wrapper">
    <img
      :src="require(`assets/images/summary_03.png`)"
      class="mx-auto mt-6 md:mt-16 mb-7 w-[175px] md:w-[292px]"
    />
    <div id="content" class="w-10/12 mx-auto lg:max-w-[648px] B_04">
      <div class="font-bold">
        3. การกลับมาของศาลรัฐธรรมนูญตามรัฐธรรมนูญแห่งราชอาณาจักรไทย พุทธศักราช
        2550
      </div>
      <div class="mt-[10px]">
        ศาลรัฐธรรมนูญชุดนี้มีแนวโน้มการวินิจฉัยที่สร้างผลบวกกับฝั่งการเมืองสายอำนาจเก่า
        และทหาร ที่มีอำนาจในเวลานั้น เช่น วินิจฉัยให้พรรคประชาธิปัตย์
        รอดจากการถูกยุบพรรค 2 ครั้ง และสร้างผลลบกับฝั่งการเมืองสายทักษิณ ชินวัตร
        ที่มีอำนาจในช่วงนั้น อย่างเช่น
      </div>
      <div class="mt-7">
        <div id="list-dot" />
        วินิจฉัยยุบพรรคพลังประชาชน + สมชาย วงศ์สวัสดิ์
        หลุดจากตำแหน่งนายกรัฐมนตรี
      </div>
      <div>
        <div id="list-dot" />
        วินิจฉัยให้สมัคร สุนทรเวช และยิ่งลักษณ์ ชินวัตร
        หลุดจากตำแหน่งนายกรัฐมนตรี
      </div>
      <div>
        <div id="list-dot" />
        วินิจฉัยให้กฎหมายที่จะออกในสมัยรัฐบาลยิ่งลักษณ์ ชินวัตร ถูกขัดขวาง
      </div>
      <div>
        <div id="list-dot" />
        วินิจฉัยให้การเลือกตั้งที่พรรคเพื่อไทยกำลังได้เปรียบ กลายเป็นโมฆะ
      </div>
    </div>
  </div>
</template>
