<template>
  <div id="intro-step-wrapper" class="relative z-50 text-center B_03">
    <div id="step-1" class="flex items-center h-screen">
      <div
        class="
          h-max
          md:w-[673px]
          w-10/12
          mx-auto
          border-2 border-black
          md:px-9
          px-4
          py-5
          bg-white
        "
      >
        นับตั้งแต่ที่ศาลรัฐธรรมนูญถูกจัดตั้งขึ้นเป็นองค์กรตุลาการตามรัฐธรรมนูญจนถึงปัจจุบัน
        หลากหลายการวินิจฉัยของศาลสร้างผลลัพธ์สำคัญต่อเรื่องการเมืองของประเทศไทยอย่างปฏิเสธไม่ได้
        และในหลายครั้ง
        เหตุการณ์สำคัญทางการเมืองก็ส่งผลต่อการทำงานของศาลรัฐธรรมนูญในการสร้างผลลัพธ์สำคัญทางการเมือง
        โดยสามารถสร้างแนวโน้มของผลลัพธ์บางอย่างที่น่าสนใจ
      </div>
    </div>
    <div id="step-2" class="flex items-center h-screen">
      <div
        class="
          h-max
          md:w-[673px]
          w-10/12
          mx-auto
          border-2 border-black
          md:px-9
          px-4
          py-9
          bg-white
        "
      >
        ELECT
        ขอพาทุกคนดูตัวอย่างคำวินิจฉัยศาลรัฐธรรมนูญที่ก่อให้เกิดผลลัพธ์สำคัญทางการเมือง
        พร้อมกับความสัมพันธ์ต่อเหตุการณ์สำคัญทางการเมืองที่ส่งผลต่อสร้างผลลัพธ์สำคัญทางการเมือง
        รวมถึงผลงานของตุลาการรัฐธรรมนูญแต่ละคนในศาลรัฐธรรมนูญแต่ละชุด
        ว่าลงมติที่สร้างผลลัพธ์สำคัญทางการเมืองอย่างไรกันบ้าง
      </div>
    </div>
    <div id="step-3" class="flex items-center h-screen">
      <div
        class="
          h-max
          md:w-[673px]
          w-10/12
          mx-auto
          border-2 border-black
          md:px-9
          px-4
          py-14
          bg-white
        "
      >
        จากการวินิจฉัยศาลรัฐธรรมนูญมากกว่า 350 เรื่อง
        นับตั้งแต่ที่ศาลรัฐธรรมนูญถูกจัดตั้งเป็นองค์กรตุลาการตามรัฐธรรมนูญจนถึงปัจจุบัน
        <div class="mt-10">
          เราขอคัดตัวอย่าง "22 การวินิจฉัย"
          ที่ก่อให้เกิดผลลัพธ์สำคัญทางการเมืองไทย มาตีแผ่รายละเอียดต่าง ๆ ว่า
          การวินิจฉัยนั้นเกิดขึ้นในสมัยรัฐบาลใด
          ผลโหวตขององค์คณะตุลาการเป็นอย่างไร
          และสร้างผลลัพธ์สำคัญทางการเมืองอย่างไรบ้าง
          รวมถึงเป็นผลดีหรือผลเสียต่อรัฐบาลที่มีอำนาจในยุคนั้น ๆ
        </div>
      </div>
    </div>
  </div>
</template>

<
