<template>
  <div id="intro-step-wrapper" class="relative z-50 text-center B_03">
    <div id="step-1" class="flex items-center my-[100px] md:h-screen md:my-0">
      <div
        class="
          h-max
          md:w-[673px]
          w-10/12
          mx-auto
          border-2 border-black
          md:px-9
          px-4
          py-5
          bg-white
          box-shadow-style
        "
      >
        นับตั้งแต่ศาลรัฐธรรมนูญถูกจัดตั้งขึ้น
        มีหลายครั้งที่การวินิจฉัยของศาลสร้างผลลัพธ์สำคัญต่อการเมืองไทย
        และมีหลายเหตุการณ์สำคัญที่ส่งผลต่อการวินิจฉัยของศาลในการสร้างผลลัพธ์สำคัญทางการเมือง
        นำมาซึ่งแนวโน้มของผลลัพธ์บางอย่างที่น่าสนใจ
      </div>
    </div>
    <div id="step-2" class="flex items-center my-[100px] md:h-screen md:my-0">
      <div
        class="
          h-max
          md:w-[673px]
          w-10/12
          mx-auto
          border-2 border-black
          md:px-9
          px-4
          py-9
          bg-white
          box-shadow-style
        "
      >
        ทำความรู้จัก “ศาลรัฐธรรมนูญกับการเมือง”
        ผ่านตัวอย่างการวินิจฉัยของศาลรัฐธรรมนูญที่ก่อให้เกิดผลลัพธ์สำคัญทางการเมือง
        เหตุการณ์สำคัญที่ส่งผลต่อสร้างผลลัพธ์สำคัญทางการเมือง
        และผลงานของตุลาการรัฐธรรมนูญแต่ละคน
        ว่ามีส่วนสร้างผลลัพธ์สำคัญทางการเมืองอย่างไรบ้าง
      </div>
    </div>
    <div id="step-3" class="flex items-center my-[100px] md:my-0 md:h-screen">
      <div
        class="
          h-max
          md:w-[673px]
          w-10/12
          mx-auto
          border-2 border-black
          md:px-9
          px-4
          py-14
          bg-white
        "
      >
        นับตั้งแต่ถูกจัดตั้งเป็นองค์กรตุลาการตามรัฐธรรมนูญ
        ศาลรัฐธรรมนูญได้ทำการวินิจฉัยคดีไปมากกว่า 350 เรื่อง
        ซึ่งหลายเรื่องสร้างผลลัพธ์สำคัญต่อการเมืองไทย

        <div class="mt-10">
          ตัวอย่าง "22 การวินิจฉัย" ที่ก่อให้เกิดผลลัพธ์สำคัญต่อการเมืองไทย
          ถูกคัดเลือกมาเพื่อตีแผ่รายละเอียดต่าง ๆ เช่น
          การวินิจฉัยนั้นเกิดขึ้นในสมัยรัฐบาลใด
          ผลโหวตขององค์คณะตุลาการเป็นอย่างไร
          และสร้างผลลัพธ์สำคัญทางการเมืองอย่างไร
          รวมถึงส่งผลดีหรือผลเสียต่อรัฐบาลที่มีอำนาจในยุคนั้น
        </div>
      </div>
    </div>
  </div>
</template>

<
